Documents/ПриходныйОрдерНаТовары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>ПриходныйОрдерНаТовары</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
	</Document>
</MetaDataObject>

AccumulationRegisters/СвободныеОстатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<AccumulationRegister>
		<Properties>
			<Name>СвободныеОстатки</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВНаличии</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВРезервеСоСклада</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВРезервеПодЗаказ</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыКОтгрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыКОтгрузке</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВРезерве</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОтгрузке</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОформлению</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КСборке</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Собирается</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Собрано</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОтправительПолучательТоваров</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОтгрузки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РаспоряжениеНаОтгрузку</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ПриходныйОрдерНаТовары/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура Рин1_ПередЗаписьюПеред(Отказ, ПараметрыЗаписи)
	// + [Rineco], [Шерстюк Ю.Ю.] [31.08.2021] 
	// Задача: [№ 8957], [Проверяем резервы при уменьшении количества]
	Если не Объект.Ссылка.Пустая() и ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Объект.Ссылка,"Статус") = ПредопределенноеЗначение("Перечисление.СтатусыПриходныхОрдеров.Принят")
		и ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Объект.Ссылка,"Проведен") Тогда
	 
		СтруктураВозврата = ПолучитьПострадавшиеРезервы();
		Отказ = СтруктураВозврата.Отказ;
			//Откроем форму для сопоставления
		Если Отказ Тогда
				ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьПослеОкончания", ЭтотОбъект, ПараметрыЗаписи);
				ОткрытьФорму("Документ.ПриходныйОрдерНаТовары.Форма.Рин1_ФормаРезервовКОтмене", СтруктураВозврата, ЭтаФорма, ,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;	
	КонецЕсли;	
	// - [Rineco], [Шерстюк Ю.Ю.] [31.08.2021]

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеОкончания(РезультатЗакрытия,ДополнительныеПараметры) Экспорт
	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПострадавшиеРезервы()
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТаблицаОбъекта.Номенклатура КАК Номенклатура,
	                      |	ТаблицаОбъекта.Характеристика КАК Характеристика,
	                      |	ТаблицаОбъекта.Количество КАК Количество
	                      |ПОМЕСТИТЬ ТаблицаОбъекта
	                      |ИЗ
	                      |	&ТаблицаОбъекта КАК ТаблицаОбъекта
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТаблицаФормы.Количество КАК Количество,
	                      |	ТаблицаФормы.Номенклатура КАК Номенклатура,
	                      |	ТаблицаФормы.Характеристика КАК Характеристика
	                      |ПОМЕСТИТЬ ТаблицаФормы
	                      |ИЗ
	                      |	&ТаблицаФормы КАК ТаблицаФормы
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТаблицаОбъекта.Номенклатура КАК Номенклатура,
	                      |	ТаблицаОбъекта.Характеристика КАК Характеристика,
	                      |	СУММА(ТаблицаОбъекта.Количество) КАК Количество
	                      |ПОМЕСТИТЬ ТаблицаОбъектаИтог
	                      |ИЗ
	                      |	ТаблицаОбъекта КАК ТаблицаОбъекта
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ТаблицаОбъекта.Номенклатура,
	                      |	ТаблицаОбъекта.Характеристика
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТаблицаФормы.Номенклатура КАК Номенклатура,
	                      |	ТаблицаФормы.Характеристика КАК Характеристика,
	                      |	СУММА(ТаблицаФормы.Количество) КАК Количество
	                      |ПОМЕСТИТЬ ТаблицаФормыИтог
	                      |ИЗ
	                      |	ТаблицаФормы КАК ТаблицаФормы
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ТаблицаФормы.Номенклатура,
	                      |	ТаблицаФормы.Характеристика
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТаблицаОбъектаИтог.Номенклатура КАК Номенклатура,
	                      |	ТаблицаОбъектаИтог.Характеристика КАК Характеристика,
	                      |	ТаблицаОбъектаИтог.Количество КАК Количество,
	                      |	ВЫБОР
	                      |		КОГДА ЕСТЬNULL(ТаблицаФормыИтог.Количество, 0) < ТаблицаОбъектаИтог.Количество
	                      |			ТОГДА ТаблицаОбъектаИтог.Количество - ЕСТЬNULL(ТаблицаФормыИтог.Количество, 0)
	                      |	КОНЕЦ КАК КоличествоОтменено,
	                      |	ТаблицаОбъектаИтог.Количество КАК КоличествоОбъект,
	                      |	ТаблицаФормыИтог.Количество КАК КоличествоФорма
	                      |ПОМЕСТИТЬ ВТ_Сравнение
	                      |ИЗ
	                      |	ТаблицаОбъектаИтог КАК ТаблицаОбъектаИтог
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаФормыИтог КАК ТаблицаФормыИтог
	                      |		ПО ТаблицаОбъектаИтог.Номенклатура = ТаблицаФормыИтог.Номенклатура
	                      |			И ТаблицаОбъектаИтог.Характеристика = ТаблицаФормыИтог.Характеристика
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_Сравнение.Номенклатура КАК Номенклатура,
	                      |	ВТ_Сравнение.Характеристика КАК Характеристика,
	                      |	ВТ_Сравнение.КоличествоОтменено КАК Количество,
	                      |	ВТ_Сравнение.КоличествоОбъект КАК КоличествоОбъект,
	                      |	ВТ_Сравнение.КоличествоФорма КАК КоличествоФорма
	                      |ПОМЕСТИТЬ ВТ_Отклонения
	                      |ИЗ
	                      |	ВТ_Сравнение КАК ВТ_Сравнение
	                      |ГДЕ
	                      |	ВТ_Сравнение.КоличествоОтменено > 0
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_Отклонения.Номенклатура КАК Номенклатура,
	                      |	ВТ_Отклонения.Характеристика КАК Характеристика,
	                      |	ВЫБОР
	                      |		КОГДА (ЕСТЬNULL(СвободныеОстаткиОстатки.ВНаличииОстаток, 0) - ЕСТЬNULL(СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток, 0) - ВТ_Отклонения.Количество) * -1 > ВТ_Отклонения.Количество
	                      |			ТОГДА -ВТ_Отклонения.Количество
	                      |		ИНАЧЕ ЕСТЬNULL(СвободныеОстаткиОстатки.ВНаличииОстаток, 0) - ЕСТЬNULL(СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток, 0) - ВТ_Отклонения.Количество
	                      |	КОНЕЦ КАК Отклонение,
	                      |	ВТ_Отклонения.Количество КАК Количество,
	                      |	СвободныеОстаткиОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
	                      |	&Склад КАК Склад,
	                      |	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК Назначение
	                      |ПОМЕСТИТЬ ВТ_Недостача
	                      |ИЗ
	                      |	ВТ_Отклонения КАК ВТ_Отклонения
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СвободныеОстатки.Остатки(&ДатаДокумента, Склад = &Склад) КАК СвободныеОстаткиОстатки
	                      |		ПО ВТ_Отклонения.Номенклатура = СвободныеОстаткиОстатки.Номенклатура
	                      |			И ВТ_Отклонения.Характеристика = СвободныеОстаткиОстатки.Характеристика
	                      |ГДЕ
	                      |	ВЫБОР
	                      |			КОГДА (ЕСТЬNULL(СвободныеОстаткиОстатки.ВНаличииОстаток, 0) - ЕСТЬNULL(СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток, 0) - ВТ_Отклонения.Количество) * -1 > ВТ_Отклонения.Количество
	                      |				ТОГДА -ВТ_Отклонения.Количество
	                      |			ИНАЧЕ ЕСТЬNULL(СвободныеОстаткиОстатки.ВНаличииОстаток, 0) - ЕСТЬNULL(СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток, 0) - ВТ_Отклонения.Количество
	                      |		КОНЕЦ < 0
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТоварыКОтгрузкеОстатки.Номенклатура КАК Номенклатура,
	                      |	ТоварыКОтгрузкеОстатки.Характеристика КАК Характеристика,
	                      |	ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК ДокументОтгрузки,
	                      |	СУММА(ТоварыКОтгрузкеОстатки.ВРезервеОстаток + ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток + ТоварыКОтгрузкеОстатки.КСборкеОстаток + ТоварыКОтгрузкеОстатки.СобираетсяОстаток + ТоварыКОтгрузкеОстатки.СобраноОстаток) КАК ВРезерве
	                      |ПОМЕСТИТЬ ВТ_ВРезерве
	                      |ИЗ
	                      |	РегистрНакопления.ТоварыКОтгрузке.Остатки(
	                      |			&ДатаДокумента,
	                      |			(Номенклатура, Характеристика, Назначение, Склад) В
	                      |				(ВЫБРАТЬ
	                      |					ВТ_Недостача.Номенклатура,
	                      |					ВТ_Недостача.Характеристика,
	                      |					ВТ_Недостача.Назначение,
	                      |					ВТ_Недостача.Склад
	                      |				ИЗ
	                      |					ВТ_Недостача)) КАК ТоварыКОтгрузкеОстатки
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ТоварыКОтгрузкеОстатки.Номенклатура,
	                      |	ТоварыКОтгрузкеОстатки.Характеристика,
	                      |	ТоварыКОтгрузкеОстатки.ДокументОтгрузки
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_Недостача.Номенклатура КАК Номенклатура,
	                      |	ВТ_Недостача.Характеристика КАК Характеристика,
	                      |	-ВТ_Недостача.Отклонение КАК Отклонение,
	                      |	ВТ_ВРезерве.ВРезерве КАК ВРезерве,
	                      |	ВТ_ВРезерве.ДокументОтгрузки КАК ДокументОтгрузки
	                      |ИЗ
	                      |	ВТ_Недостача КАК ВТ_Недостача
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВРезерве КАК ВТ_ВРезерве
	                      |		ПО (ВТ_ВРезерве.Номенклатура = ВТ_Недостача.Номенклатура)
	                      |			И (ВТ_ВРезерве.Характеристика = ВТ_Недостача.Характеристика)
	                      |ИТОГИ
	                      |	СУММА(Отклонение)
	                      |ПО
	                      |	Номенклатура");
	Запрос.УстановитьПараметр("Склад",Объект.Склад);
	Запрос.УстановитьПараметр("ДатаДокумента",ТекущаяДата());//будем смотреть состояние на момент отмены.

	Запрос.УстановитьПараметр("ТаблицаФормы",РеквизитФормыВЗначение("Объект.Товары").Выгрузить());
	Запрос.УстановитьПараметр("ТаблицаОбъекта", Объект.Ссылка.Товары.Выгрузить());
	пРезультат =  Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Отказ",?(пРезультат.Строки.Количество()> 0,Истина,Ложь));
	СтруктураВозврата.Вставить("ВыборкаПострадавших",ПоместитьВоВременноеХранилище(пРезультат));
   	Возврат СтруктураВозврата;
КонецФункции
